# BuiltInFailures.MechanicalFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MechanicalFailures Class
BuiltInFailures Class Members See Also
---
Failures about HVAC.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class MechanicalFailures
```

Visual Basic
---
```text
Public NotInheritable Class MechanicalFailures
```

Visual C++
---
```text
public ref class MechanicalFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..MechanicalFailures
# See Also
BuiltInFailures..::..MechanicalFailures Members
Autodesk.Revit.DB Namespace